# 1. Перемножить все нечётные значения в диапазоне от 1 до 100. Распечатать только результат
# p=1
# for i in range(1,100):
#     if i%2!=0:
#       p=i*i
# print(p)



# 2. Записать в массив все числа в диапазоне от 1 до 500 кратные 5. Печатать не нужно!



# list=[]
# for a in range (1,500):
#  if a%5==0:
#     list.append(a)


# 3. Вывести на экран все чётные значения в диапазоне от 1 до 497 в один ряд
#for i in range(1,497):
#   if i %2==0:
#      print(i,end=' ')

#4. Дан массив чисел. Если число встречается более двух раз, то добавить его в новый массив.

# ar1 = [1,2,3,4,5,6,6,6,6,6,6,6,6,7,7,8]
# ar2= []
# for i in ar1:
#     if ar1.count(i)>=2 and i not in ar2:
#         ar2.append (i)
# print(ar2)


# ar1 = [1,2,3,4,5,6,6,6,6,6,6,6,6,7,7,8]
# ar2= []
# for i in ar1:
#     if ar1.count(i)>=2 and i not in ar2:
#         ar2.append (i)
#     print(ar2)