# срезы 
s='programing'
print (s[3])    #третий символ строки
print(s[8])     #предпоследний символ этой строки
print (s[:5])   #первые пять символов этой строки
print(s[:8])    #вся строка, кроме последних двух символов
print(s[1::2])  #все символы с четными индексами (считая, что индексация начинается с 0
print(s[2::2])  #все символы с нечетными индексами, то есть начиная со второго символа строки
print(s[::-1])  #все символы в обратном порядке
print(s[::-2])  #все символы строки через один в обратном порядке, начиная с последнего
print(s[::])    #выведите длину данной строки



