# 1. Допишите скрипт для расчета средней температуры
# week_temp = (26, 29, 34, 32, 28, 26, 23)
# sum_temp =sum(week_temp)
# days =7
# mean_temp = sum_temp / days
# print(int(mean_temp))

#2. Найти самое длинное слово в кортеже ('a', 'z', 'hello_world!')
#
# my_tuple=('a', 'z', 'hello_world!')
# my_tuple=str(my_tuple)
# print(max(my_tuple))

#3. Преобразовать текст в кортеж слов с удалением знаков препинания.
# # if i in ''' :;[]{}=+-_"' '''
# line =('строка для переделки,c удалением знаков препинания! ')
# line_tuple=tuple(line)
# for i in line:
#  print(i, end=', ')
#

  








