# 1. В списке, содержащем положительные и отрицательные целые числа, вычислите сумму чётных положительных элементов.

# a=[-10,-7,-5-2-1,1,2,3,4,5,6,7,8,9,10,11,12,13,15,18,20,25]
# sum=0
# for i in a:
#   if i>0 and i%2==0:
#      sum=i+i
#   print(sum)

# 2. Найти в списке те элементы, значение которых меньше среднего арифметического, взятого от всех элементов списка.

# lst = [5, 7, 10, 15, 22, 7, 40, 32,]
# lst_sum=sum(lst)
# lst_len=len(lst)
# lst_sr=lst_sum/lst_len
# top_lst=[]
# for i in lst:
#  if i<lst_sr:
#   top_lst.append(i)
# print (top_lst)
#
#




